instagram-clone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)

        if @post.save!
---
INSERT INTO "posts" ("image", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["image", "demoProfile.jpg"], ["created_at", "2022-04-09 17:22:17.651216"], ["updated_at", "2022-04-09 17:22:17.651216"]]